poiuy105/uart0to1/sdkconfig.defaults
# Console 使用 USB Serial/JTAG，不占用 UART0
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y

# 禁用 secondary console 避免干扰
CONFIG_ESP_CONSOLE_SECONDARY_NONE=y

# ESP32-C3 目标芯片
CONFIG_IDF_TARGET="esp32c3"
